n2nresult/n2n-11k-1594407287.txt
wrk -t 20 -c 100 -d30s -R 60000 -file_k 11 --latency http://192.168.1.4:8089
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread calibration: mean lat.: 670.453ms, rate sampling interval: 2303ms
  Thread calibration: mean lat.: 670.098ms, rate sampling interval: 2312ms
  Thread calibration: mean lat.: 672.507ms, rate sampling interval: 2310ms
  Thread calibration: mean lat.: 673.076ms, rate sampling interval: 2310ms
  Thread calibration: mean lat.: 679.322ms, rate sampling interval: 2334ms
  Thread calibration: mean lat.: 679.051ms, rate sampling interval: 2330ms
  Thread calibration: mean lat.: 683.010ms, rate sampling interval: 2330ms
  Thread calibration: mean lat.: 682.433ms, rate sampling interval: 2330ms
  Thread calibration: mean lat.: 679.104ms, rate sampling interval: 2320ms
  Thread calibration: mean lat.: 676.804ms, rate sampling interval: 2320ms
  Thread calibration: mean lat.: 689.163ms, rate sampling interval: 2344ms
  Thread calibration: mean lat.: 684.420ms, rate sampling interval: 2334ms
  Thread calibration: mean lat.: 686.942ms, rate sampling interval: 2336ms
  Thread calibration: mean lat.: 694.916ms, rate sampling interval: 2359ms
  Thread calibration: mean lat.: 694.082ms, rate sampling interval: 2353ms
  Thread calibration: mean lat.: 684.244ms, rate sampling interval: 2338ms
  Thread calibration: mean lat.: 689.676ms, rate sampling interval: 2342ms
  Thread calibration: mean lat.: 697.402ms, rate sampling interval: 2359ms
  Thread calibration: mean lat.: 696.411ms, rate sampling interval: 2355ms
  Thread calibration: mean lat.: 696.531ms, rate sampling interval: 2357ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.49s   698.17ms   3.75s    57.67%
    Req/Sec     2.64k     6.80     2.65k    73.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2502.66 ms
 75.000%    3100.67 ms
 90.000%    3452.93 ms
 99.000%    3672.06 ms
 99.900%    3727.36 ms
 99.990%    3745.79 ms
 99.999%    3753.98 ms
100.000%    3756.03 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1209.343     0.000000            4         1.00
    1522.687     0.100000       105692         1.11
    1766.399     0.200000       211211         1.25
    2009.087     0.300000       316468         1.43
    2254.847     0.400000       421830         1.67
    2502.655     0.500000       527678         2.00
    2621.439     0.550000       579833         2.22
    2744.319     0.600000       632956         2.50
    2865.151     0.650000       686047         2.86
    2981.887     0.700000       738081         3.33
    3100.671     0.750000       791460         4.00
    3160.063     0.775000       817482         4.44
    3219.455     0.800000       843646         5.00
    3278.847     0.825000       870111         5.71
    3336.191     0.850000       896329         6.67
    3395.583     0.875000       923368         8.00
    3424.255     0.887500       936361         8.89
    3452.927     0.900000       949191        10.00
    3481.599     0.912500       962003        11.43
    3510.271     0.925000       975375        13.33
    3538.943     0.937500       988723        16.00
    3553.279     0.943750       995394        17.78
    3567.615     0.950000      1002176        20.00
    3581.951     0.956250      1008842        22.86
    3596.287     0.962500      1015410        26.67
    3610.623     0.968750      1021999        32.00
    3616.767     0.971875      1024715        35.56
    3624.959     0.975000      1028189        40.00
    3633.151     0.978125      1031421        45.71
    3641.343     0.981250      1034513        53.33
    3651.583     0.984375      1037979        64.00
    3657.727     0.985938      1039903        71.11
    3661.823     0.987500      1041172        80.00
    3667.967     0.989062      1042905        91.43
    3674.111     0.990625      1044524       106.67
    3680.255     0.992188      1046024       128.00
    3684.351     0.992969      1046944       142.22
    3688.447     0.993750      1047803       160.00
    3692.543     0.994531      1048649       182.86
    3696.639     0.995313      1049380       213.33
    3702.783     0.996094      1050414       256.00
    3704.831     0.996484      1050740       284.44
    3706.879     0.996875      1051045       320.00
    3710.975     0.997266      1051613       365.71
    3713.023     0.997656      1051864       426.67
    3717.119     0.998047      1052328       512.00
    3719.167     0.998242      1052531       568.89
    3721.215     0.998437      1052724       640.00
    3723.263     0.998633      1052932       731.43
    3725.311     0.998828      1053119       853.33
    3727.359     0.999023      1053292      1024.00
    3729.407     0.999121      1053437      1137.78
    3729.407     0.999219      1053437      1280.00
    3731.455     0.999316      1053587      1462.86
    3733.503     0.999414      1053715      1706.67
    3735.551     0.999512      1053824      2048.00
    3735.551     0.999561      1053824      2275.56
    3735.551     0.999609      1053824      2560.00
    3737.599     0.999658      1053919      2925.71
    3739.647     0.999707      1053997      3413.33
    3739.647     0.999756      1053997      4096.00
    3741.695     0.999780      1054062      4551.11
    3741.695     0.999805      1054062      5120.00
    3741.695     0.999829      1054062      5851.43
    3743.743     0.999854      1054111      6826.67
    3743.743     0.999878      1054111      8192.00
    3745.791     0.999890      1054156      9102.22
    3745.791     0.999902      1054156     10240.00
    3745.791     0.999915      1054156     11702.86
    3745.791     0.999927      1054156     13653.33
    3747.839     0.999939      1054187     16384.00
    3747.839     0.999945      1054187     18204.44
    3747.839     0.999951      1054187     20480.00
    3747.839     0.999957      1054187     23405.71
    3749.887     0.999963      1054207     27306.67
    3749.887     0.999969      1054207     32768.00
    3749.887     0.999973      1054207     36408.89
    3749.887     0.999976      1054207     40960.00
    3751.935     0.999979      1054215     46811.43
    3751.935     0.999982      1054215     54613.33
    3751.935     0.999985      1054215     65536.00
    3753.983     0.999986      1054223     72817.78
    3753.983     0.999988      1054223     81920.00
    3753.983     0.999989      1054223     93622.86
    3753.983     0.999991      1054223    109226.67
    3753.983     0.999992      1054223    131072.00
    3753.983     0.999993      1054223    145635.56
    3756.031     0.999994      1054230    163840.00
    3756.031     1.000000      1054230          inf
#[Mean    =     2492.688, StdDeviation   =      698.169]
#[Max     =     3753.984, Total count    =      1054230]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1578343 requests in 30.00s, 1.25GB read
Requests/sec:  52618.99
Transfer/sec:     42.65MB
wrk -t 20 -c 100 -d30s -R 60000 -file_k 11 --latency http://192.168.1.4:8089
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread calibration: mean lat.: 787.179ms, rate sampling interval: 2605ms
  Thread calibration: mean lat.: 796.439ms, rate sampling interval: 2621ms
  Thread calibration: mean lat.: 791.080ms, rate sampling interval: 2605ms
  Thread calibration: mean lat.: 791.958ms, rate sampling interval: 2605ms
  Thread calibration: mean lat.: 796.206ms, rate sampling interval: 2648ms
  Thread calibration: mean lat.: 798.714ms, rate sampling interval: 2623ms
  Thread calibration: mean lat.: 803.215ms, rate sampling interval: 2629ms
  Thread calibration: mean lat.: 800.403ms, rate sampling interval: 2623ms
  Thread calibration: mean lat.: 794.843ms, rate sampling interval: 2611ms
  Thread calibration: mean lat.: 806.248ms, rate sampling interval: 2635ms
  Thread calibration: mean lat.: 804.641ms, rate sampling interval: 2639ms
  Thread calibration: mean lat.: 803.526ms, rate sampling interval: 2633ms
  Thread calibration: mean lat.: 801.022ms, rate sampling interval: 2619ms
  Thread calibration: mean lat.: 810.888ms, rate sampling interval: 2654ms
  Thread calibration: mean lat.: 813.859ms, rate sampling interval: 2654ms
  Thread calibration: mean lat.: 810.646ms, rate sampling interval: 2646ms
  Thread calibration: mean lat.: 817.149ms, rate sampling interval: 2666ms
  Thread calibration: mean lat.: 820.891ms, rate sampling interval: 2703ms
  Thread calibration: mean lat.: 818.954ms, rate sampling interval: 2666ms
  Thread calibration: mean lat.: 813.918ms, rate sampling interval: 2652ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.85s   805.59ms   4.36s    58.13%
    Req/Sec     2.58k    10.77     2.59k    81.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2846.72 ms
 75.000%    3538.94 ms
 90.000%    3983.36 ms
 99.000%    4243.45 ms
 99.900%    4308.99 ms
 99.990%    4349.95 ms
 99.999%    4366.34 ms
100.000%    4366.34 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1391.615     0.000000            6         1.00
    1742.847     0.100000       103138         1.11
    2018.303     0.200000       206279         1.25
    2293.759     0.300000       309997         1.43
    2568.191     0.400000       412537         1.67
    2846.719     0.500000       515876         2.00
    2983.935     0.550000       567706         2.22
    3123.199     0.600000       618796         2.50
    3268.607     0.650000       670488         2.86
    3405.823     0.700000       722318         3.33
    3538.943     0.750000       773801         4.00
    3610.623     0.775000       799251         4.44
    3682.303     0.800000       824988         5.00
    3751.935     0.825000       850785         5.71
    3823.615     0.850000       876457         6.67
    3905.535     0.875000       902240         8.00
    3948.543     0.887500       915594         8.89
    3983.359     0.900000       928184        10.00
    4018.175     0.912500       941359        11.43
    4050.943     0.925000       954103        13.33
    4083.711     0.937500       966802        16.00
    4102.143     0.943750       973866        17.78
    4118.527     0.950000       980024        20.00
    4134.911     0.956250       986168        22.86
    4153.343     0.962500       993061        26.67
    4169.727     0.968750       999274        32.00
    4177.919     0.971875      1002267        35.56
    4188.159     0.975000      1005830        40.00
    4198.399     0.978125      1009304        45.71
    4206.591     0.981250      1011899        53.33
    4218.879     0.984375      1015370        64.00
    4227.071     0.985938      1017525        71.11
    4231.167     0.987500      1018510        80.00
    4239.359     0.989062      1020366        91.43
    4247.551     0.990625      1022176       106.67
    4255.743     0.992188      1023758       128.00
    4259.839     0.992969      1024477       142.22
    4263.935     0.993750      1025212       160.00
    4268.031     0.994531      1025879       182.86
    4272.127     0.995313      1026533       213.33
    4276.223     0.996094      1027135       256.00
    4280.319     0.996484      1027664       284.44
    4284.415     0.996875      1028168       320.00
    4288.511     0.997266      1028587       365.71
    4292.607     0.997656      1028999       426.67
    4296.703     0.998047      1029355       512.00
    4296.703     0.998242      1029355       568.89
    4300.799     0.998437      1029703       640.00
    4300.799     0.998633      1029703       731.43
    4304.895     0.998828      1029990       853.33
    4308.991     0.999023      1030245      1024.00
    4308.991     0.999121      1030245      1137.78
    4313.087     0.999219      1030378      1280.00
    4317.183     0.999316      1030471      1462.86
    4321.279     0.999414      1030582      1706.67
    4325.375     0.999512      1030689      2048.00
    4325.375     0.999561      1030689      2275.56
    4329.471     0.999609      1030798      2560.00
    4329.471     0.999658      1030798      2925.71
    4333.567     0.999707      1030877      3413.33
    4333.567     0.999756      1030877      4096.00
    4337.663     0.999780      1030911      4551.11
    4337.663     0.999805      1030911      5120.00
    4341.759     0.999829      1030938      5851.43
    4345.855     0.999854      1030974      6826.67
    4349.951     0.999878      1031016      8192.00
    4349.951     0.999890      1031016      9102.22
    4349.951     0.999902      1031016     10240.00
    4354.047     0.999915      1031041     11702.86
    4354.047     0.999927      1031041     13653.33
    4358.143     0.999939      1031060     16384.00
    4358.143     0.999945      1031060     18204.44
    4358.143     0.999951      1031060     20480.00
    4362.239     0.999957      1031086     23405.71
    4362.239     0.999963      1031086     27306.67
    4362.239     0.999969      1031086     32768.00
    4362.239     0.999973      1031086     36408.89
    4362.239     0.999976      1031086     40960.00
    4362.239     0.999979      1031086     46811.43
    4366.335     0.999982      1031107     54613.33
    4366.335     1.000000      1031107          inf
#[Mean    =     2851.362, StdDeviation   =      805.586]
#[Max     =     4362.240, Total count    =      1031107]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1544101 requests in 30.00s, 1.22GB read
Requests/sec:  51476.81
Transfer/sec:     41.73MB